# Bonus: Temperature Analysis I

In [1]:
import pandas as pd
from datetime import datetime as dt

In [2]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [4]:
# Convert the date column format from string to datetime
df['date'] = pd.to_datetime(df['date'])

In [6]:
# Set the date column as the DataFrame index
df_date_index = df.set_index('date')
df_date_index.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

In [26]:
# Drop the date column
# not needed with above cell
# instead, creating new column with month number
df['month'] = pd.DatetimeIndex(df['date']).month
df.head()
df_drop_na = df.dropna()
df_drop_na = df_drop_na.set_index('date')
df_drop_na.head()

                station  prcp  tobs  month
date
2010-01-01  USC00519397  0.08    65      1
2010-01-02  USC00519397  0.00    63      1
2010-01-03  USC00519397  0.00    74      1
2010-01-04  USC00519397  0.00    76      1
2010-01-07  USC00519397  0.06    70      1

### Compare June and December data across all years

In [23]:
from scipy import stats

In [43]:
# Filter data for desired months
June_temps = df_drop_na.loc[df_drop_na['month']==6]
Dec_temps = df_drop_na.loc[df_drop_na['month']==12]

In [37]:
# Identify the average temperature for June
June_group = June_temps.groupby(['month'])
June_avg = June_group.mean()
June_avg

          prcp       tobs
month
6      0.13636  74.887548

In [36]:
# Identify the average temperature for December
Dec_group = Dec_temps.groupby(['month'])
Dec_avg = Dec_group.mean()
Dec_avg

           prcp       tobs
month
12     0.216819  70.930249

In [47]:
# Create collections of temperature data
June_temps_list = June_temps['tobs'].tolist()
Dec_temps_list = Dec_temps['tobs'].tolist()

In [53]:
# Run paired t-test
stats.ttest_ind(June_temps_list, Dec_temps_list, equal_var=False)

Ttest_indResult(statistic=30.624201480767336, pvalue=6.622829250184814e-178)

### Analysis

Within this dataset, the difference in average temperatures in Hawai'i between June and December are statistically highly significant, even though the average temperature only shows a difference of approximately 4°F.  That means that there is little overlap in temperatures between those two months.  It's fair to assume that December will be about 4°F cooler than June.